---
kind: property
id: P:Autodesk.Revit.DB.ViewScheduleExportOptions.TextQualifier
source: html/8448fbb8-efe9-4b4d-0c87-7dedbef3b5a0.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.TextQualifier Property

How to qualify text fields. Default is DoubleQuote.

## Syntax (C#)
```csharp
public ExportTextQualifier TextQualifier { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration